Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Reunion.tmx
Source language: en
Languages: es_419

source: not to scare you, but i don’t think that one training camp ten years ago is enough to cut it...
es_419: no quiero asustarte, pero el curso de defensa que tomaste hace diez años podría no ser suficiente…

source: we haven’t seen a crowd like that in a long time!
es_419: ¡no hemos visto una multitud así en mucho tiempo!

source: congratulations, you got the whole school’s attention, just like you wanted.
es_419: felicitaciones, toda la escuela te está mirando, como querías.

source: ...but i can’t do this anymore.
es_419: … pero ya no doy más.

source: he wouldn’t have had the guts to tell me how he feels, or look me in the eye when he does it.
es_419: no habría tenido la valentía de explicarme cómo se siente o de mirarme a los ojos cuando habla.

source: oh. i see.
es_419: ah, entiendo.

source: no way, how long has it been? i can barely recognise you! you look so...
es_419: increíble, ¿cuánto tiempo ha pasado? ¡apenas te reconozco! te ves tan…

source: tch, this isn’t fun anymore. let’s go.
es_419: bah, ya no es divertido. vámonos.

source: i’m a regular there, if i ask nicely they might throw in some free breadsticks!
es_419: soy cliente habitual, así que si lo pido con amabilidad, ¡nos darán pan de ajo gratis!

source: eh?
es_419: ¿mm?

source: no... that man...
es_419: no… ese tipo…

source: ...i know who you are.
es_419: sé quién eres.

source: yeah. it is.
es_419: así es.

source: hey, what happened to your hand?
es_419: oye, ¿qué le pasó a tu mano?

source: excuse me-
es_419: permiso…

source: she’s the one you talked about, right? the one you bumped into a couple of months ago.
es_419: es quien me mencionaste, ¿no? la que te encontraste hace un par de meses.

source: were you... um...
es_419: ¿estabas… mmm…

source: aw, don’t say that! you still have bas with you, remember?
es_419: ¡ay, no digas eso! bas estará contigo.

source: you both have been too negligent with your responsibilities.
es_419: ambos fueron demasiado negligentes con sus responsabilidades.

source: OKAYBYE!
es_419: ¡bueno, adiós!

source: i mean, i don’t judge!
es_419: ¡no te estoy juzgando!

source: so what you’re saying is...
es_419: entonces, lo que dices es que…

source: a girl...?
es_419: ¿una chica?…

source: aw, you still kept this photo? this was ages ago! i thought it’d go missing by now.
es_419: ooh, ¿aún conservas esta foto? ¡fue hace años! pensé que se habría perdido.

source: ...i think that’s him.
es_419: … creo que es él.

source: it involves making decisions many can’t understand, taking risks we wouldn’t advise others to take…
es_419: implica tomar decisiones que muchos no entienden y asumir riesgos que le recomendaríamos a otros no tomar…

source: you good, buddy?
es_419: ¿estás bien, amigo?

source: but the more i know him, the less i do.
es_419: pero cada vez sé menos sobre él.

source: y’know, you’ve changed too, rhea.
es_419: tú también cambiaste.

source: i wasn’t ready for you to see me like this.
es_419: no estaba preparado para que me vieras así.

source: no no, i’m a special old man, i’m limited edition. it’s different.
es_419: ah, no. yo soy un viejo especial, de edición limitada. es distinto.

source: please, i want to go home-
es_419: por favor, quiero volver a casa…

source: ...when you walk out that door, you don’t have to talk to me again, and i won’t hold it against you. i promise.
es_419: … cuando salgas por esa puerta, ya no tendrás que volver a hablarme. te prometo que no te lo reprocharé.

source: hey, wait, you can’t leave!
es_419: oye, espera, ¡no puedes irte!

source: if someone still chooses to do that...
es_419: si, incluso así, alguien lo hiciera…

source: OH, bas!
es_419: ¡ah, bas!

source: but everything you just said is not true.
es_419: pero nada de lo que dices es cierto.

source: oh no, it’s not like that!
es_419: ¡n-no, no es eso!

source: what happened last night was real, and i knew i couldn’t hide things from you any longer.
es_419: lo que pasó anoche fue real, y sabía que no podía seguir ocultándotelo.

source: ah, damn._x0003_i missed the last bus...
es_419: ay, no. perdí el último autobús…

source: wait... a little girl?
es_419: ¿pero qué…? ¿una niñita?

source: are you sure you saw him leave?
es_419: ¿estás segura de que lo viste irse?

source: don’t worry, i won’t be long. i just need a drink. coffee will do.
es_419: no te preocupes, no voy a quedarme mucho tiempo. solo tomaré un café.

source: okay, where is he?
es_419: bien, ¿dónde está?

source: i want you to keep it. and you can give it back to me...
es_419: quiero que tú lo guardes. me lo devolverás…

source: not exactly. i still don’t know if i should be rooting for them.
es_419: no estoy seguro. aún no sé si debería alentar algo así.

source: hah, nice! i knew you couldn’t say no to me!
es_419: ¡genial! ¡sabía que no me dirías que no!

source: hi, welcome to pic-
es_419: hola, bienvenida a…

source: oh... i don’t really think about that. it’s a job, i guess.
es_419: mm… no pienso mucho sobre el asunto. es solo un trabajo.

source: um, just regular work things.
es_419: lo normal, ya sabes, trabajo.

source: ah, crap. i shouldn’t be eavesdropping!
es_419: oh, vaya. ¡no debería escuchar a escondidas!

source: but you must first be strong enough to control your emotions. until then...
es_419: pero antes, debes ser capaz de controlar tus emociones. hasta entonces…

source: man, i don’t know. on one hand, i can see why people want them gone...
es_419: vaya, no sé. por un lado, entiendo por qué la gente quiere que se vayan…

source: by the WAY, RHEA...
es_419: a propósito, rhea…

source: you should learn to trust yourself a little more.
es_419: debes aprender a confiar más en ti mismo.

source: it’s not safe for a girl to be out alone at night...
es_419: no es seguro que una chica ande sola de noche…

source: ...this time...
es_419: ... de que esta vez...

source: rh- hey, are you okay?
es_419: rh… oye, ¿estás bien?

source: maybe your uh... girlfriend is calling?
es_419: ¿quizá tu, eh… novia te está llamando?

source: help!
es_419: ¡auxilio!

source: god, it’s always the same with these guys.
es_419: cielos, con estos tipos siempre es igual.

source: listen, i’m sorry i came uninvited. now that i know you’re fine, i’ll leave.
es_419: oye, siento haber venido sin invitación. ahora que sé que estás bien, me iré.

source: pretty...
es_419: qué lindo…

source: so say your prayers, cuz you’re going to hell.
es_419: así que empieza a rezar, porque irás al infierno.

source: the one by the lake? i think so.
es_419: ¿las del lago? creo que sí.

source: besides, you’re not together anymore, so why does it matter who he is seeing now?
es_419: y si ya no están juntos, ¿por qué te interesa con quién sale?

source: but he didn’t show anyway, so it doesn’t matter-
es_419: pero no importa, porque él no apareció…

source: so... you took off in a hurry last night after our dinner with Rhea.
es_419: te fuiste corriendo anoche después de que cenáramos con rhea.

source: a-anyway! what are the chances of us meeting like this again, right?
es_419: d-de igual modo, qué casualidad que nos volvamos a encontrar, ¿verdad?

source: stuff like that interests you?
es_419: ¿te interesan esas cosas?

source: don’t worry about it, it’s a pretty mundane job.
es_419: no te preocupes, es un trabajo bastante rutinario.

source: how is he doing?
es_419: ¿cómo está?

source: i never thought i’d see you again.
es_419: no pensé que volvería a verte.

source: sorry that we have to borrow him for awhile.
es_419: lamento robárselo por un rato.

source: oh, okay. thanks.
es_419: ah, bien. gracias.

source: okay, i’ll try there then. thanks bas!
es_419: bien. intentaré ahí. ¡gracias, bas!

source: the law is manmade anyway. they are just a set of rules decided by some old guys to keep things in order.
es_419: la ley está escrita por personas. solo son un montón de reglas creadas por unos viejos para que las cosas sigan igual.

source: there’s just way too much proof of their existence, yet somehow, no face reveal! would you believe that?
es_419: hay demasiadas pruebas de que existen, ¡pero no sé por qué nunca les ven las caras! increíble, ¿no?

source: i didn’t mean to be short, i just...
es_419: no quería ser cortante, solo…

source: hmm, i see.
es_419: mmm, ya veo.

source: what would you do if you knew someone like that?
es_419: ¿qué harías si te encontraras con alguien así?

source: hey, leaving so soon?
es_419: ¡eh! ¿ya te vas?

source: i can’t make you stay if you want to go, so...
es_419: no puedo obligarte a que te quedes, así que…

source: shiro... a-are you... a stripper?
es_419: shiro… ¿e-eres… stripper?

source: you are the other girl.
es_419: que tú eres la otra mujer.

source: oi, show some respect! i’m talking to you!
es_419: ¡ey! ¡muestra respeto, te estoy hablando!

source: wait, so you actually think he was cheating on you with ME?
es_419: espera, ¿entonces crees que te engañaba conmigo?

source: Hi, I'm Steph and I live with my dog.
es_419: Hola, soy Steph y vivo con mi perro.

source: his... family? what do they do, exactly?
es_419: ¿su… familia? ¿qué hacen exactamente?

source: man, what a way to start a sunday, am i right? so much for sleeping in...
es_419: uf, qué manera de empezar un domingo, ¿no? podríamos estar durmiendo…

source: normally the house would be a lot busier, but you’re early. the rest of us are asleep.
es_419: normalmente la casa es bulliciosa, pero es temprano. el resto de la gente duerme.

source: ugh...
es_419: aag…

source: NO, STOP!
es_419: ¡no, para!

source: SLASH
es_419: ZAAS

source: i guess you’ll have to trust me, then.
es_419: entonces tendrás que confiar en mí.

source: no way, you’re joking, right?!
es_419: imposible, bromeas, ¡¿verdad?!

source: wait, you mean they are real?
es_419: aguarda, ¿dices que es cierto?

source: do you think you could trust them at all?
es_419: ¿crees que podrías confiar en esa persona?

source: it really was him...
es_419: así que era él…

source: i mean, i just like my room a lot-
es_419: es que me encanta mi cuarto.

source: so if the rumors are true, you must be pretty tough then?
es_419: si los rumores son ciertos, debes ser un tipo duro, ¿no?

source: no matter how careful you think you are...
es_419: no importa lo cuidadoso que creas que eres…

source: well, shame on me, i guess. so much for having a great night...
es_419: supongo que es mi culpa. hasta aquí llegó mi noche de diversión…

source: the last one i agreed to meet didn’t even bother showing.
es_419: el tipo con el que acepté encontrarme ni siquiera apareció.

source: i was not a baby.
es_419: no era un bebé.

source: okay, sure! the city is a lot different now, maybe you can start by showing me your favourite place around here?
es_419: ¡claro, seguro! la ciudad es muy diferente ahora. podrías comenzar por mostrarme tu lugar favorito.

source: yo, if tea at home tasted this good, i’d be serving myself a cup every morning!
es_419: eey, si el té que tenemos en casa fuera como este, ¡tomaría todas las mañanas!

source: so if i’m going down, you are coming with me!
es_419: si voy a perder, ¡ustedes también perderán!

source: but you chose to make a fuss and now we’re in this mess...
es_419: pero armaste un escándalo y ahora estamos en este lío…

source: look, bas was raised by professional hairdressers, you can’t compare your fate with his.
es_419: bas fue criado por peluqueros profesionales, no puedes comparar tu suerte con la suya.

source: well, you’re unlikely to find any of them at this hour...
es_419: mmm, no creo que la encuentres a esta hora…

source: i gotta say, Rhea, you seem to attract customers.
es_419: rhea, déjame decirte que atraes a los clientes.

source: ohh? hey, look who it is.
es_419: ¡aah! ey, miren quién es.

source: ...everything.
es_419: … todo.

source: listen, i get why you’re worried, but I’ll be fine! it’s not your job to take care of me.
es_419: escucha, entiendo por qué te preocupas, ¡pero estaré bien! no tienes que cuidarme.

source: who the heck-
es_419: ¿quién diablos…?

source: and i guess that would make sense, right? why you don’t talk about it, why you’re always out late at night, and how you’re tired all the time-
es_419: eso tendría sentido, ¿no? no quieres hablar del tema, sales tarde en la noche y siempre estás cansado…

source: rhea, do i look like a stripper to you?
es_419: rhea, ¿tengo aspecto de stripper?

source: so it really was you.
es_419: así que eras tú.

source: yeah...
es_419: sí…

source: Things are looking bleak, until she bumps into a familiar face - one she didn't think she would ever see again.
es_419: Las cosas no salen bien hasta que encuentra una cara conocida, una que no pensó que volvería a ver.

source: wait, you can read that?
es_419: aguarda, ¿puedes leer eso?

source: so, am i wrong?
es_419: ¿me equivoco?

source: that man...
es_419: ese tipo…

source: i know you don’t want to talk about it, but could you at least try to consider how i was feeling too? how scared and worried I was?!
es_419: sé que no quieres hablar de eso, pero ¿puedes al menos tratar de entender cómo me sentí? ¡¿lo asustada y preocupada que estaba?!

source: officials believe the two men belong to a local vigilante group with ties to a series of similar incidents that have been occurring in the city for decades...
es_419: "las autoridades creen que son parte de un grupo de justicieros vinculados a una serie de incidentes similares que han ocurrido en la ciudad por décadas"…

source: i’ve got a date! hehe.
es_419: ¡tengo una cita! je, je.

source: you mean the same place he used to live before?
es_419: ¿te refieres al lugar donde vivía antes?

source: i saw you leaving his place just a minute ago. at this hour? you’re not even hiding the fact that you spent the night.
es_419: te vi saliendo de su casa hace un instante. ¿a esta hora? ni siquiera ocultas que pasaste la noche ahí.

source: i really doubt it.
es_419: lo dudo.

source: the only reason why i’d even be with someone else last night was because you failed to show up.
es_419: la única razón por la que estuve con él anoche fue porque tú no apareciste.

source: that’s okay.
es_419: no importa.

source: you got in the way of our business that night.
es_419: esa noche nos estropeaste el negocio.

source: he hasn’t changed too much though, just looks a little different. i’m surprised we can even recognise each other.
es_419: no cambió demasiado, aunque su aspecto ahora es un poco diferente. hasta me sorprende que nos hayamos reconocido.

source: sorry about that, i wasn’t looking...
es_419: lo lamento, no quise…

source: oh. um, yeah.
es_419: ah, mmm, sí.

source: gonna introduce me to your special friend?
es_419: ¿me presentas a tu amiga especial?

source: please stay back and call an ambulance.
es_419: mantente alejada y llama a una ambulancia.

source: you can toss it out. ciao.
es_419: puedes tirarlo. ciao.

source: go on then, prove it. show us what you can do, or are you too scared?
es_419: vamos, demuéstralo. a ver qué puedes hacer, ¿o tienes miedo?

source: young man, you are not pulling this on me again-
es_419: muchacho, no me hagas esto de nuevo…

source: naw, rhea, you don’t have to do that!
es_419: ¡no, rhea, no es necesario!

source: heh, you’re lucky you’ve still got the age advantage.
es_419: je, tienes suerte de ser joven. eso es una ventaja.

source: ow! stop it, ow!
es_419: ¡ay! para, ¡ay!

source: ah, it’s pretty late. do you have to go?
es_419: ah, es bastante tarde. ¿debes irte?

source: ooh, wait, i think i know what this is about...
es_419: aah, espera, creo que sé de qué se trata esto…

source: probably not, if you put it that way...
es_419: considerándolo así… probablemente, no.

source: shiro, wait!
es_419: ¡espera, shiro!

source: tch... damn this bastard...
es_419: tch… maldito imbécil…

source: w-wait, those eyes...
es_419: e-espera, esos ojos…

source: no. i don’t want to go back.
es_419: no, no deseo hacer eso.

source: OH, yeah! sure, of course. cool, cool.
es_419: ¡ah, sí! claro. genial, genial.

source: miss, we have to get you to safety first-
es_419: señorita, su seguridad está primero…

source: it’s n-not what it looks like...!
es_419: ¡n-no es lo que crees!…

source: don’t worry.
es_419: tranquila.

source: yeah. i’m sorry.
es_419: sí, lo siento.

source: i am. i should be.
es_419: sí. es lo lógico.

source: YOU BITCH.
es_419: maldita.

source: of course. you know i don’t lose things.
es_419: claro que la tengo. nunca pierdo nada.

source: it’s been awhile, but i’ve had my suspicions and i never asked.
es_419: hace mucho que lo sospechaba, pero no quería preguntarte.

source: well, no...? actually, i don’t know.
es_419: mmm, ¿no?… en realidad, no lo sé.

source: wait, before you go-
es_419: espera, antes de irte…

source: look, i don’t know what went down between the both of you, nor do i need to know.
es_419: mira, no sé qué pasó entre ustedes, ni me interesa.

source: no, you ate it all, remember?
es_419: no. te lo comiste, ¿recuerdas?

source: please-
es_419: por favor…

source: because i’ve changed.
es_419: porque he cambiado.

source: okay, i can see how it looks, but i promise you it’s not what you think-
es_419: bien, sé lo que parece, pero te aseguro que no es lo que piensas.

source: right. yeah, okay.
es_419: entiendo. está bien.

source: ART & STORY BY STEPHATTYY
es_419: arte e historia: stephattyy

source: well, i’d like to pretend i can read, but i really only know this from memory.
es_419: bueno, quisiera fingir que puedo leerlo, pero en realidad lo sé de memoria.

source: how can you forget? it was your idea.
es_419: ¿cómo pudiste olvidarlo? fue idea tuya.

source: sorry, could you repeat yourself? i lost you there.
es_419: lo siento, ¿me lo repites? no te escuché.

source: well, yeah. i just help out with a family business. it’s nothing special.
es_419: bueno, solo ayudo en el negocio familiar. nada especial.

source: geez, don’t worry, it’s just a scratch. besides, it wasn’t even a fair fight!
es_419: cielos, no es más que un rasguño. además, ¡no era una pelea justa!

source: i um, i was just trying to meet more people!
es_419: yo, mm, ¡solo trataba de conocer a alguien!

source: it’s in my blood, and i can’t erase that.
es_419: está en mi sangre y no lo puedo borrar.

source: ahh... right.
es_419: aah… ya.

source: fine, say we got all that covered, you’re still... okay being around someone like me?.
es_419: bien, olvidemos eso. aun así… ¿estás cómoda relacionándote con alguien como yo?

source: but we could always do this some other time, cuz it’s not like i’m going anywhere anytime soon, unless you’re leaving this time-
es_419: pero podemos vernos en otro momento, no es que vaya a huir de la ciudad. a menos que seas tú quien se mude esta vez…

source: he was acting so distant, especially during our last few months together.
es_419: se volvió tan distante, sobre todo en los últimos meses que pasamos juntos.

source: did you like what you see?
es_419: ¿te gustó lo que viste?

source: i’m sorry, i just… i didn’t know what to say. i thought i was protecting you.
es_419: lo siento, es que… no sabía qué decir. fue mi forma de protegerte.

source: because that version of me you hold on to, the one you said goodbye to at the carnival... he’s not here anymore.
es_419: porque esa versión mía con la que te quedaste, a la que dijiste "adiós" en la feria… ya no existe.

source: try again tomorrow, seriously? who does he think he is?
es_419: ¿intenta de nuevo mañana? ¿pero quién se cree que es?

source: ain’t that right?
es_419: ¿no te parece?

source: finally. i’m here...
es_419: al fin. ya llegué…

source: you have a long shift at work tomorrow, don’t you?
es_419: mañana te toca cubrir un turno largo, ¿no?

source: thanks for staying with me...
es_419: gracias por quedarte conmigo…

source: i am so sick of having the same fight with you over and over!
es_419: ¡estoy harta de tener la misma pelea una y otra vez!

source: ah, it’s okay! i’ll get this one.
es_419: no pasa nada. yo invito esta vez.

source: hmm. right.
es_419: mmm. ya.

source: so, where to?
es_419: ¿a dónde vamos?

source: ooh, you have a job? what do you do?
es_419: ¡ah! ¿tienes un empleo? ¿qué haces?

source: well, some other night, maybe.
es_419: sí, quizá otro día.

source: oh! no sir, i’m here for... shiro?
es_419: no, señor. vengo a ver a… shiro.

source: we have five men down over here!
es_419: ¡hay cinco hombres caídos!

source: geez, this jerk again. can’t he just leave him alone?
es_419: uf, otra vez ese imbécil. ¿por qué no lo deja en paz?

source: ...i wish you called sooner.
es_419: ojalá hubieras llamado antes.

source: that will be $18.50, cash or card?
es_419: son 18 dólares. ¿efectivo o tarjeta?

source: w-wait, get away from me!
es_419: e-esperen, ¡suéltenme!

source: these days i’m beginning to think this “family business” he says he is involved in...
es_419: empiezo a creer que ese "negocio familiar" del que dice ser parte…

source: he’s hurt!
es_419: ¡está herido!

source: listen, son, i may be bad at math, but relationships are not foreign to me.
es_419: mira, hijo, soy malo en matemáticas, pero de relaciones sí que sé.

source: i never thought i’d see you again...
es_419: no pensé que volvería a verte…

source: yo.
es_419: hola.

source: ...or are you just clinging onto the past?
es_419: … o solo te estás aferrando al pasado?

source: oh, he’s here.
es_419: ah, ya llegó.

source: Iekami, right?
es_419: iekami, ¿no?

source: yep, that’s the one.
es_419: sí, exacto.

source: okay.
es_419: bueno.

source: what the-?!
es_419: ¡¿qué dem…?!

source: ...i know you.
es_419: te conozco.

source: i’m not bad...
es_419: no soy malo…

source: i have a few questions about a man i was seeing...
es_419: tengo varias preguntas sobre el hombre con el que salía…

source: i wonder if i made shiro uncomfortable...
es_419: me pregunto si habré incomodado a shiro…

source: and who knows? maybe they can tell me all about it sometime, since i can be pretty nosy and i’m not afraid to admit it!
es_419: ¿quién sabe? ¡quizá me contaría muchas cosas sobre cómo es eso! soy bastante entrometida ¡y no me da vergüenza admitirlo!

source: they must have an important reason.
es_419: … sería por un motivo importante.

source: what do you mean? it’s not much! but i might’ve left my wallet at home...
es_419: ¿a qué te refieres? ¡no es mucho! pero creo que dejé mi billetera en casa…

source: ...when it feels like i don’t know you at all.
es_419: … cuando siento que no te conozco en absoluto.

source: what- why are you so shy all of a sudden?!
es_419: ¡¿por qué eres tan tímido de repente?!

source: i knew it. that man...
es_419: lo sabía. ese hombre…

source: ah, well, i did grow up here, but i moved away and now i’m back, so you’re not wrong.
es_419: bueno, crecí aquí, pero luego me mudé y ahora estoy de vuelta, así que no te equivocas.

source: …you heard what grandpa said. there will always be consequences.
es_419: … ya escuchaste al abuelo. siempre habrá consecuencias.

source: it happens, he tends to disappeaar and show up a day or two later.
es_419: eso pasa siempre. desaparece y vuelve a aparecer un par de días después.

source: the victim was rescued just in time by two unidentified men, now dubbed as the “mysterious anti-heroes”...
es_419: "la víctima fue rescatada a tiempo por dos hombres no identificados, a quienes llaman 'misteriosos antihéroes'"…

source: wait...
es_419: aguarda…

source: so yeah, you can come over and crash anytime! jae and pascoal won’t mind either.
es_419: ¡puedes quedarte a dormir cuando quieras! a jae y a pascoal tampoco les importará.

source: i didn’t even know of your existence until i saw the two of you outside that cafe the other day.
es_419: ni siquiera sabía que existías hasta que los vi en el café el otro día.
